# ------------ Parameter glossary (розширений довідник) ------------
DEFAULT_PARAM_GLOSSARY = {
    "dimensions_mm_height": [
        "висота мм",
        "габаритна висота",
        "высота мм",
        "height mm",
        "overall height",
        "device height",
    ],

    "dimensions_mm_length": [
        "довжина мм",
        "габаритна довжина",
        "длина мм",
        "length mm",
        "overall length",
        "device length",
    ],

    "dimensions_mm_width": [
        "ширина мм",
        "габаритна ширина",
        "ширина мм",
        "width mm",
        "overall width",
        "device width",
    ],

    "dimensions_mm": [
        "габарити",
        "габаритні розміри",
        "размеры",
        "Розміри",
        "габариты",
        "dimensions mm",
        "overall dimensions",
        "dimensions (l w h)",
    ],

    "operating_temperature_range_degc": [
        "діапазон робочих температур",
        "робочий температурний діапазон",
        "рабочий диапазон температур",
        "operating temperature range",
        "working temperature range",
        "allowed operating temperature",
    ],

    "operating_temperature_range_degc_min": [
        "мінімальна робоча температура",
        "нижня межа робочої температури",
        "минимальная рабочая температура",
        "minimum operating temperature",
        "min operating temp",
    ],

    "operating_temperature_range_degc_max": [
        "максимальна робоча температура",
        "верхня межа робочої температури",
        "максимальная рабочая температура",
        "maximum operating temperature",
        "max operating temp",
    ],

    "ip_rating": [
        "ступінь захисту ip",
        "ip рейтинг",
        "степень защиты ip",
        "ip protection rating",
        "ingress protection",
        "ip code",
    ],

    "weight_kg": [
        "вага",
        "маса",
        "вес",
        "weight kg",
        "device weight",
    ],

    # -----------общие параметры для ИНВЕРТОРОВ И БАТАРЕЙ-----

    #    "battery_type": [
    #      "Підтримуваний тип акумуляторів (наприклад, літій-іонні, свинцево-кислотні)",
    #      "battery type",
    #      "Пидтримуваний тип акумуляторив (наприклад, литий-ионни, свинцево-кислотни)",
    #      "battery_type",
    #      "Тип акумулятора",
    #      "Тип батареї",
    #      "тип АКБ",
    #      "тип батареи"
    # ],

    "cooling_type": [
        "cooling_type",
        "Тип охолодження",
        "Тип охлаждения",
        "природне охолодження чи з вентилятором",
        "активне/пасивне охолодження",
        "forced / natural convection",
        "способ охлаждения"
    ],

    "max_ac_output_power_w": [
        "max ac output power",
        "Максимальна вихідна потужність по AC",
        "max_ac_output_power",
        "максимальная выходная мощность",
        "максимальна потужність",
        "максимальна потужність по мережі",
        "nominal + overload AC power",
        "допустимая активная мощность на выходе"
    ],

    "max_charge_current_a": [
        "max charge current",
        "Максимальний струм заряджання",
        "max_charge_current",
        "Максимальний зарядний струм",
        "максимальний зарядний струм",
        "максимальний зарядний струм",
        "максимальный ток заряда АКБ",
        "допустимый зарядный ток",
        "charging current limit"
    ],
    "max_discharge_current_a": [
        "max discharge current",
        "Максимальний струм розряджання",
        "max_discharge_current",
        "максимальный ток разряда АКБ",
        "максимальний розрядний струм",
        "допустимый разрядный ток",
        "струм розряду",
        "discharge current limit"
    ],

    "short_circuit_current_a": [
        "max short circuit current per mppt",
        "Максимальний струм КЗ на один MPPT",
        "max_short_circuit_current_per_mppt",
        "ток короткого замыкания на входе MPPT",
        "струм КЗ",
        "струм короткого замикання",
        "максимальний вхідний струм КЗ",
        "максимальний вхідний струм КЗ",
        "максимальний струм короткого замикання"
        "допустимий струм КЗ панелей на трекер",
        "Isc per MPPT",
        "струм короткого замикання від ФЕМ на MPPT"
    ],

    "peak_output_power_w": [
        "peak output power",
        "Пікова вихідна потужність",
        "кратковременная максимальная мощность",
        "пікова потужність при перевантаженні",
        "overload power",
        "кратковременная перегрузочная мощность",
        "peak AC power",
    ],
    "warranty": [
        "warranty",
        "Гарантийний термин вид виробника",
        "Гарантійний параметр",
        "Гарантійний термін від виробника",
        "гарантія виробника",
        "срок гарантии",
        "warranty period",
        "гарантійні умови"
    ],
    "noise_db": [
        "Рівень шуму",
        "noise",
        "уровень шума",
        "шумность работы",
        "шум в дБ",
        "noise level dB",
        "гучність вентилятора/охолодження"
    ],

    "battery_voltage_range_full_load_v": [
        "Діапазон напруги АКБ для забезпечення повного навантаження",
        "battery_voltage_range_full_load",
        "Диапазон напруги АКБ для забезпечення повного навантаження",
        "battery voltage range full load",
        "напруга АКБ для повного навантаження",
        "допустимий діапазон напруги при повній потужності",
        "діапазон напруги АКБ при повному навантаженні",
        "діапазон напруги  під повним навантаженням",
        "напруга АКБ (від-до) при повній потужності",
        "робочий діапазон напруги АКБ на повному навантаженні",
        "напруга від-до при максимальній потужності"
    ],
    "battery_voltage_range_full_load_v_max": [

        "напруга для повного навантаження",
        "максимальна напруга при повному навантаженні",
        "верхня межа напруги під повним навантаженням",
        "максимальний поріг напруги для повної потужності",
        "макс напруга на повному навантаженні"
    ],
    "battery_voltage_range_full_load_v_min": [
        "напруга АКБ для повного навантаження",
        "мінімальна напруга при повному навантаженні",
        "нижня межа напруги під повним навантаженням",
        "напруги тримає повну потужність",
        "мінімальний поріг напруги АКБ для повної потужності",
        "мін напруга на повному навантаженні"
    ],

    "battery_voltage_range_v": [
        "battery voltage range",
        "Допустимий діапазон напруги",
        "Допустимий диапазон напруги",
        "battery_voltage_range",
        "діапазон напруги",
        "робоча напруга",
        "диапазон напряжения",
        "допустима напруга на",
        "діапазон напруги (робочий)",
        "діапазон напруги",
        "робоча напруга від-до",
        "робочий діапазон DC напруги від",
        "допустимий діапазон напруги"
    ],

    "battery_voltage_range_v_max": [

        "допустима напруга на",
        "максимальна робоча напруга",
        "верхня межа робочої напруги",
        "максимальний поріг напруги",
        "макс робоча напруга"
    ],

    "battery_voltage_range_v_min": [

        "нижня межа робочої напруги",
        "мінімальний поріг напруги",
        "мінімальна робоча напруга",
        "мін робоча напруга"
    ],

    # -----------общие параметры для ИНВЕРТОРОВ И СЧЕТЧИКОВ---
    "ac_connection_type": [
        "ac_connection_type",
        "тип підключення AC",
        "тип підключення AC",
        "тип підключення",
        "однофазне чи трифазне підключення",
        "тип подключения по AC (1 фаза / 3 фазы)",
        "phase connection type",
        "фазність",

        "однофаза чи трифаза",
        "1ф / 3ф",
        "фазність підключення",
        "single/three phase",
        "по фазах як підключається"

    ],
    "ac_voltage_range_v": [
        "ac voltage range",
        "Допустимий диапазон мережевої напруги",
        "ac_voltage_range",
        "Допустимий діапазон мережевої напруги",
        "діапазоні напруги мережі",
        "диапазон допустимого сетевого напряжения",
        "grid voltage window",
        "min/max AC voltage",
        "диапазон допустимого сетевого напряжения",
        "напруга від-до",
        "напруга діапазон",
        "напруга min/max",
    ],

    "frequency_range_hz_max": [
        "максимальна частота",
        "верхня межа частоти",
        "макс частота",
        "максимальний поріг частоти"
    ],

    "frequency_range_hz_min": [

        "мінімальна частота",
        "нижня межа частоти",
        "мін частота",
        "мінімальний поріг частоти"
    ],

    "frequency_range_hz": [
        "діапазон частоти",
        "робочий діапазон частоти",
        "частотний діапазон",
        "рабочий диапазон частоты",
        "frequency range",
        "operating frequency range",
        "grid frequency range",
        "allowed frequency range",
        "Частота",
        "Робоча частота"
    ],

    "grid_monitoring": [
        "grid monitoring",
        "Моніторинг параметрів",
        "контроль сети",
        "контроль напруги і частоти",
        "мониторинг сетевых параметров",
        "grid monitoring function",
        "контроль якості електромережі"
    ],

    "nominal_ac_current_a": [
        "nominal ac current",
        "Номінальний вихідний струм по AC",
        "nominal_ac_current",
        "номинальный выходной ток",
        "струм при номінальній потужності",
        "вихідний струм при Pnom",
        "rated AC current"
    ],

    # -----------общие параметры для ИНВЕРТОРОВ, БАТАРЕЙ, СЧЕТЧИКОВ, СКБ---
    "certifications": [
        "certifications",
        "сертифікації та маркування (CE, TÜV тощо)",
        "сертифікати на",
        "сертификация",
        "Сертифікація",
        "какие сертификаты соответствия есть у",
        "сертифікація продукції (CE/UKCA/UL)",
        "позначення сертифікатів на шильді"
    ],

    # -----------общие параметры для ИНВЕРТОРОВ, БАТАРЕЙ, СЧЕТЧИКОВ, ЕПМ---

    "nominal_ac_voltage_v": [
        "nominal ac voltage",
        "Номінальна вихідна напруга по AC",
        "nominal_ac_voltage",
        "номинальное выходное напряжение",
        "вихідна напруга",
        "Номінальна напруга",
        "Номинальное напряжение",
        "rated AC voltage",
        "фазная/линейная номинальная напруга"
    ],

    # -----------общие параметры для ИНВЕРТОРОВ, БАТАРЕЙ, СЧЕТЧИКОВ, ЛОГГЕРОВ---

    "display_type": [
        "display_type",
        "Тип дисплея",
        "Тип екрану",
        "ЖК-дисплей / LED-індикатори",
        "тип индикации на корпусе",
        "экран",
        "Дісплей",
        "Тип дисплею",
        "HMI display type"
    ],

    # -----------общие параметры для ИНВЕРТОРОВ, СЧЕТЧИКОВ, ЕПМ---

    "max_ac_current_output_a": [
        "Максимальний вихідний AC струм",
        "max_ac_current_output",
        "max ac output current",
        "максимальный выходной ток AC",
        "струм на виході",
        "нагрузочный ток"
    ],

    # -----------общие параметры для ИНВЕРТОРОВ, БАТАРЕЙ, СЧЕТЧИКОВ, ЛОГГЕРОВ, СКБ---
    "altitude_m": [
        "Висота над рівнем моря",
        "altitude",
        "Максимальна висота установки над рівнем моря",
        "высота над уровнем моря",
        "допустимая высота установки",
        "altitude rating"
    ],

    # -----------общие параметры для ИНВЕРТОРОВ, БАТАРЕЙ, СЧЕТЧИКОВ--

    "communication_interfaces": [
        "communication_interfaces",
        "Комунікаційні інтерфейси (RS485, CAN, Wi-Fi тощо)",
        "інтерфейси зв’язку",
        "интерфейсы связи (RS485/CAN/ETH/Wi-Fi)",
        "порты комунікацій",
        "інтерфейси моніторингу",
        "communication ports"
    ],

    # -----------общие параметры для ИНВЕРТОРОВ, ЕПМ--
    "topology": [
        "topology",
        "Топологія",
        "тип схемы",
        "трансформаторная/безтрансформаторная схема",
        "схема підключення (однофазна/трифазна/гибридна)",
        "inverter topology",
        "архитектура силовой части"
    ],

    # -----------общие параметры для БАТАРЕЙ, СЧЕТЧИКОВ--

    # "compatible_inverters": [
    #        "список сумісних інверторів",
    #        "які моделі інверторів підтримуються",
    #        "список совместимых инверторов",
    #        "какие модели инверторов поддерживаются",
    #        "compatible inverters",
    #        "supported inverter models"
    #    ],

    # -----------общие параметры для БАТАРЕЙ, СЧЕТЧИКОВ, ЛОГГЕРОВ, ЕПМ, СКБ---

    "humidity_range_perc_max": [
        "максимальна відносна вологість",
        "верхня межа вологості",
        "max humidity",
        "максимальная влажность"
    ],
    "humidity_range_perc_min": [
        "мінімальна відносна вологість",
        "нижня межа вологості",
        "min humidity",
        "минимальная влажность"
    ],

    "humidity_range_perc": [
        "діапазон вологості",
        "відносна вологість експлуатації",
        "humidity range",
        "допустимий діапазон вологості",
        "рабочий диапазон влажности"
    ],

    # -----------общие параметры для БАТАРЕЙ, СЧЕТЧИКОВ, ЛОГГЕРОВ,  СКБ---

    "storage_temp_range_degc_max": [
        "максимальна температура зберігання",
        "верхня межа температури зберігання",
        "максимальная температура хранения",
        "верхний предел температуры хранения",
        "maximum storage temperature degc",
        "max storage temperature"
    ],

    "storage_temp_range_degc_min": [
        "мінімальна температура зберігання",
        "нижня межа температури зберігання",
        "минимальная температура хранения",
        "нижний предел температуры хранения",
        "minimum storage temperature degc",
        "min storage temperature"
    ],

    "storage_temp_range_degc": [
        "діапазон температури зберігання",
        "температурний діапазон зберігання",
        "storage temperature range",
        "allowed storage temperature range",
        "диапазон температур хранения",
        "допустимая температура хранения"
    ],

    # -----------общие параметры для СЧЕТЧИКОВ, ЛОГГЕРОВ, ЕПМ, СКБ---
    #    "notes": [
    #        "додаткові примітки щодо моделі",
    #        "особливі зауваження або обмеження",
    #        "дополнительные примечания по модели",
    #        "особые замечания или ограничения",
    #        "notes",
    #        "special remarks"
    #    ],
    "power_consumption_w_or_va": [
        "власне споживання потужності",
        "споживання ват або ва",
        "собственное потребление мощности",
        "потребление ватт или ва",
        "self power consumption",
        "internal consumption w or va"
    ],

    # -----------общие параметры для СЧЕТЧИКОВ, ЛОГГЕРОВ, ЕПМ ---
    # "applications": [
    #        "застосування, типові сценарії використання",
    #        "для яких задач призначено",
    #        "области применения",
    #        "для каких задач предназначено",
    #        "applications",
    #        "typical use cases"
    #    ],

    # -----------общие параметры для СЧЕТЧИКОВ, ЛОГГЕРОВ, СКБ---
    "mounting_type": [
        "тип монтажу din рейка стіна щиток",
        "як саме встановлюється",
        "тип монтажа din рейка стена щит",
        "как именно устанавливается",
        "mounting type",
        "installation mounting method"
    ],

    # -----------общие параметры для СЧЕТЧИКОВ, ЕПМ ---
    "phases": [
        "кількість фаз",
        "однофазний чи трифазний",
        "количество фаз",
        "однофазный или трехфазный",
        "number of phases",
        "single or three phase"
    ],

    # -----------общие параметры для СЧЕТЧИКОВ, ЛОГГЕРОВ---

    "variant": [
        "варіант виконання або версія моделі",
        "позначення модифікації у серії",
        "вариант исполнения или версия модели",
        "обозначение модификации в серии",
        "variant",
        "model variant code"
    ],

    # -----------общие параметры для ЛОГГЕРОВ, ЕПМ, СКБ---
    "ethernet_ports": [
        "Ethernet порти",
        "LAN порти",
        "мережеві порти Ethernet",
        "Ethernet interfaces",
        "LAN network ports",
        "RJ45 ports",
        "Підключення Інтернет"
    ],

    "rs485_ports": [
        "RS485 порти",
        "інтерфейси RS485",
        "лінії RS485",
        "RS485 interfaces",
        "RS485 communication ports",
        "serial RS485 ports",
    ],

    "wifi_support": [
        "підтримка Wi-Fi",
        "WiFi модуль",
        "бездротова підтримка WiFi",
        "WiFi support",
        "wireless connectivity",
    ],

    "4g_support": [
        "підтримка 4G",
        "4G модем",
        "4G support",
        "LTE connectivity",
        "cellular support",

        "є 4G/LTE?",
        "мобільний інтернет",
        "LTE modem",
        "cellular 4g",
        "SIM підтримка",
    ],

    "supported_protocols": [
        "підтримувані протоколи",
        "протоколи звʼязку",
        "communication protocols",
        "supported data protocols",
        "protocol compatibility",
    ],

    # -----------общие параметры для ЛОГГЕРОВ, СКБ---

    "analog_inputs": [
        "аналогові входи",
        "AI входи",
        "analog inputs",
        "AI ports",
        "analog sensor inputs",
        "вхід аналогові?",
        "входів аналогових?",
        "какой inputs аналоговые?",

    ],
    "can_ports": [
        "CAN порти",
        "інтерфейси CANbus",
        "CAN шина",
        "CAN ports",
        "CAN bus interfaces",
    ],

    "ve_can_ports": [
        "VE.Can порти",
        "інтерфейси VE.Can",
        "VE.Can ports",
        "VE CAN interfaces",
    ],

    # -----------общие параметры для ЛОГГЕРОВ, ЕПМ---
    "power_supply": [
        "живлення",
        "вхідне живлення",
        "power supply",
        "input power",
        "supply voltage",
    ],
    # -----------общие параметры для ЕПМ, СКБ---
    "cooling_method": [
        "метод охолодження",
        "тип охолодження",
        "cooling method",
        "cooling type",
    ],

    "enclosure_material": [
        "матеріал корпусу",
        "матеріал оболонки",
        "enclosure material",
        "housing material",
        "З чого корпус"
    ],

    # "installation_method": [
    #        "тип монтажу",
    #        "спосіб встановлення",
    #        "installation method",
    #        "mounting type",
    #    ],

    "local_communication": [
        "локальна комунікація",
        "локальні інтерфейси",
        "local communication",
        "local interfaces",
    ],

    # "max_inverters_supported": [
    #        "максимум інверторів",
    #        "ліміт підключення",
    #        "max inverters supported",
    #        "inverter limit",
    # "Скільки інверторів",
    #
    #    ],
    "remote_communication": [
        "віддалена комунікація",
        "дистанційний доступ",
        "remote communication",
        "remote connectivity",
    ],
    # "compatibility": [
    #        "сумісність",
    #        "сумісне обладнання",
    #        "compatibility",
    #        "supported devices",
    #        ]

    # ------------ ГЛОССАРИЙ ДЛЯ ИНВЕРТЕРОВ ------------

    "ac_coupling_support": [
        "ac_coupling_support",
        "підтримка AC-coupling",
        "робота в AC-coupled системі",
        "можливість підключити мережевий по AC",
        "работа в схеме AC coupling",
        "можно ли работать с сетевым инвертором по AC",
        "підтримка AC спряження з мережевими"
    ],
    "ac_nominal_input_output_frequency": [
        "ac_nominal_input_output_frequency",
        "номінальна частота",
        "номінальна частота вхід/вихід AC",
        "частота мережі 50/60 Гц",
        "nominal grid frequency",
        "номинальная частота",
        "частота роботи по AC",

        "ac_nominal_input_output_frequency",
        "номінальна частота",
        "номинальная частота",
        "номінальний частота",
        "rated частота",
        "частота (Гц)",
        "частота Гц"
    ],
    "ac_nominal_input_output_voltage": [
        "ac_nominal_input_output_voltage",
        "номінальна вхідна/вихідна напруга AC",
        "nominal AC input/output voltage",
        "фазна/лінійна напруга",
        "напруга мережі для роботи",
        "rated напруга",

    ],
    "ac_overcurrent_protection": [
        "Захист від перевантаження по струму",
        "ac overcurrent protection",
        "захист від надструму",
        "защита от перегрузки по току",
        "current overload protection",
        "обмеження струму на виході"
    ],
    "ac_overvoltage_protection": [
        "Захист від перенапруги на виході",
        "ac overvoltage protection",
        "захист від перенапруги",
        "защита от перенапряжения",
        "overvoltage protection",
        "відключення при завищеній напрузі",
        "protection?",
    ],
    "ac_short_circuit_protection": [
        "Захист від короткого замикання на виході",
        "ac short circuit protection",
        "защита от короткого замыкания",
        "захист від КЗ на виході",
        "short circuit protection",
        "автоматичне вимкнення при КЗ"
    ],
    #  "compatible_inverters": [
    #        "список сумісних інверторів",
    #        "які моделі інверторів підтримуються",
    #        "список совместимых инверторов",
    #        "какие модели инверторов поддерживаются",
    #        "compatible inverters",
    #        "supported inverter models"
    #    ],
    "ac_terminal": [
        "Клеми AC",
        "ac_terminal",
        "ac terminal",
        "вихідні клеми змінного струму",
        "клеми підключення",
        "клеммы AC",
        "точки подключения сети"
    ],

    "active_power_limit_range": [
        "active power limit range",
        "Діапазон обмеження активної потужності",
        "Діапазон параметр",
        "обмеження потужності у відсотках",
        "настройка ліміту активної потужності",
        "диапазон ограничения активной мощности",
        "P-limit range"
    ],
    "anti_islanding_protection": [
        "Захист від островного режиму",
        "anti-islanding protection",
        "Anti-islanding protection",
        "захист від роботи без мережі",
        "защита от островного режима",
        "antiislanding",
        "захист від острова",
        "антиострівний захист"
    ],

    "arc_fault_protection": [
        "Захист від дугового пробою",
        "arc fault protection",
        "захист від електричної дуги",
        "защита от дугового пробоя",
        "arc-fault detection",
        "AFCI",
        "Дуговий захист",
        "Дугова защита",
        "Защита от дуги"
    ],

    "aux_battery_charge_current_a": [
        "Допоміжний струм зарядки",
        "aux battery charge current",
        "aux_battery_charge_current",
        "Допоміжний зарядний струм",
        "дополнительный ток зарядки АКБ",
        "струм додаткового зарядного виходу",
        "auxiliary charge current"
    ],

    "battery_charge_efficiency_perc": [
        "ККД заряджання",
        "battery_charge_efficiency",
        "ККД зарядки АКБ",
        "коэффициент полезного действия зарядки",
        "ефективність заряджання",
        "battery charge efficiency",
        "эффективность заряда"
    ],

    "battery_reverse_protection": [
        "Захист від переполюсовки",
        "battery reverse protection",
        "захист від неправильної полярності АКБ",
        "защита от обратной полярности",
        "reverse polarity protection (battery)",
        "protection against battery reverse connection"
    ],

    "battery_temp_sensor": [
        "Датчик температури",
        "battery_temp_sensor",
        "battery temperature sensor",
        "Датчик параметр",
        "датчик температуры АКБ",
        "Сенсор температури",
        "Температурний датчик",
        "Температурній сенсор",
        "контроль температури",
        "battery temperature probe"
    ],

    "charging_strategy": [
        "Стратегія заряджання",
        "профіль зарядки",
        "charging profile",
        "алгоритм зарядки",
        "логіка заряджання",
        "етапи зарядки",
        "bulk absorption float",
        "режим буферного підзаряду",
        "підтримуючий заряд",
        "float режим",
        "absorption режим",
        "equalize зарядка",
        "температурна компенсація зарядки",
        "заряд за профілем AGM/GEL/FLA",
        "режим зарядки для LiFePO4",
        "адаптивна зарядка",
        "розумна зарядка",
        "CC/CV зарядка",
        "циклічний режим зарядки"
    ],

    "data_storage": [
        "data_storage",
        "Вбудована пам’ять для збереження даних",
        "збереження історії роботи",
        "внутрішнє сховище даних",
        "data logging",
        "встроенный логгер",
        "збереження логів роботи"
    ],

    "dc_insulation_monitoring": [
        "dc insulation monitoring",
        "Моніторинг ізоляції по DC",
        "контроль ізоляції на стороні постійного струму",
        "контроль изоляции по постоянному току",
        "Контроль ізоляції",
        "перевірка опору ізоляції DC",
        "контроль утечек на DC",
        "DC insulation monitor"
    ],

    "dc_reverse_polarity_protection": [
        "dc reverse polarity protection",
        "Захист від переполюсовки по DC",
        "защита от обратной полярности по DC",
        "захист від неправильної полярності на вході PV",
        "protection against DC reverse connection",
        "DC reverse protection",
        "захист входу постійного струму",
        "захист від переплутаних плюс-мінус",
        "переплутати полярність",
        "захист від переполюсовки",
        "випадково не так підключити"

    ],

    "dc_switch": [
        "DC вимикач",
        "dc_switch",
        "dc switch",
        "Вбудований вимикач постійного струму",
        "встроенный DC выключатель",
        "роз’єднувач по DC",
        "отключение PV по DC"
    ],
    "dc_terminal": [
        "DC клеми",
        "dc_terminal",
        "dc terminal",
        "клеми підключення сонячних панелей",
        "входні клеми постійного струму",
        "клеммы DC",
        "точки подключения PV"
    ],

    "euro_efficiency": [
        "euro_efficiency",
        "Європейський ККД",
        "ККД",
        "європейський КПД",
        "euro efficiency",
        "европейский КПД",
        "ефективність за європейським тестом"
    ],

    "full_power_mppt_voltage_range_v_max": [

    ],
    "full_power_mppt_voltage_range_v_min": [

    ],
    "full_power_mppt_voltage_range_v": [
        "напруга MPPT для повної потужності",
        "діапазон напруги MPPT для повної потужності",
        "напрузі MPPT дає максимум",
        "напруги MPPT тягне повну потужність",
        "повна потужність по напрузі MPPT",
        "робоча напруга MPPT на повній потужності",
        "коли MPPT виходить на повну потужність",
        "напруга стрінгів для повної потужності",
        "напрузі MPPT працює на максимум",
        "MPPT повна потужність напруга",
        "напруги MPPT дає потужність",
        "напрузі стрінгів максимальна потужність",
        "оптимальна напруга MPPT повної генерації"
    ],
    "generator_support": [
        "generator_support",
        "роботи з генератором",
        "окремий генераторний вхід на",
        "робота від генератора",
        "дизель-генератор",
        "generator input support",
        "Генераторний вхід",
        "Вхід генератора",
        "Підключення генератора",
        "Підключити генератор",
        "підключення генератора як джерела AC"
    ],

    "grid_regulation_standards": [
        "grid_regulation_standards",
        "мережеві стандарти та коди",
        "grid-кодам відповідає",
        "сетевым стандартам соответствует",
        "EN/VDE/ДСТУ",
        "grid regulation standards"
    ],
    "ground_fault_monitoring": [
        "ground fault monitoring",
        "Моніторинг замикань на землю",
        "контроль витоків на землю",
        "контроль замыкания на землю",
        "ground fault detection",
        "контроль изоляции на землю",
        "захист від витоків на землю"
    ],
    "humidity": [
        "Відносна вологість",
        "humidity",
        "Вологість",
        "допустимая влажность воздуха",
        "допустима вологість під час експлуатації",
        "относительная влажность",
        "humidity range"
    ],

    "iv_curve_scanning": [
        "iv curve scanning",
        "Сканування ВАХ (I-V curve)",
        "функція побудови ВАХ панелей",
        "сканирование вольт-амперной характеристики",
        "перевірка стану масиву ФЕМ по I-V",
        "iv-сканер",
        "тест I-V кривой"
    ],
    "max_ac_current_input_a": [
        "Максимальний вхідний AC струм",
        "max_ac_current_input",
        "Максимальний струм з мережі",
        "max ac input current",
        "максимальный входной ток AC",
        "максимальний мережевий струм",
        "current from grid limit"
    ],

    "max_ac_input_power_w": [
        "max ac input power",
        "Максимальна потужність по AC на вході",
        "максимальна вхідна потужність змінного струму",
        "Максимальна потужність по AC",
        "max_ac_input_power",
        "максимальная мощность, потребляемая из сети",
        "максимальна вхідна потужність з мережі",
        "power from grid limit",
        "допустима потужність на вході AC"
    ],

    "max_efficiency_perc": [
        "max efficiency",
        "Максимальний ККД",
        "max_efficiency",
        "ККД",
        "максимальный КПД",
        "peak efficiency",
        "коефіцієнт корисної дії"
    ],
    "max_input_current_per_mppt": [
        "max input current per mppt",
        "Максимальний вхідний струм на один MPPT",
        "max_input_current_per_mppt",
        "максимальный входной ток на трекер",
        "струм від панелей на один MPPT",
        "допустимий струм на MPPT",
        "максимальний струм для роз'єму DC",
        "максимальний струм на вході DC",
        "PV input current per tracker"
    ],
    "max_input_voltage_v": [
        "max input voltage",
        "Максимальна вхідна напруга по DC",
        "максимальна напруга PV",
        "max_input_voltage",
        "Максимальна напруга від сонячних панелей",
        "максимальное входное напряжение PV",
        "максимально допустима напруга ФЕМ",
        "максимальна напруга ФЕМ"
        "DC input voltage max"
    ],
    "max_inverter_backfeed_current_a": [
        "max inverter backfeed current",
        "Максимальний зворотний струм в",
        "max_inverter_backfeed_current",
        "максимальный обратный ток в",
        "допустимый ток обратной подпитки",
        "backfeed current limit",
        "зворотній струм з мережі/генератора"
    ],
    "max_parallel_units": [
        "max_parallel_units",
        "максимальна кількість у паралелі",
        "максимум можна підключити паралельно",
        "maximum number of parallel units",
        "максимальное число устройств в параллельной работе",
        "кількість пристроїв, що можуть працювати паралельно",
        "паралельна робота (кількість)"
    ],
    "max_power_per_mppt_w": [
        "max power per mppt",
        "Максимальна потужність на один MPPT",
        "max_power_per_mppt",
        "максимальная мощность на один трекер",
        "допустимая мощность на MPPT",
        "потужність масиву на MPPT",
        "PV array power per tracker"
    ],
    "max_pv_input_power_w": [
        "max pv input power",
        "Максимальна потужність вхідного PV",
        "max_pv_input_power",
        "Максимальна потужність сонячних панелей",
        "максимальная мощность PV массива",
        "допустимая мощность по стороне DC",
        "максимальна вхідна потужність ФЕМ",
        "вхідна потужність ФЕМ",
        "PV installed power limit"
    ],

    "max_unbalanced_current_a": [
        "max unbalanced current",
        "Максимальний струм небалансу по фазах",
        "max_unbalanced_current",
        "максимально допустимый ток небаланса",
        "струм дисбалансу фаз",
        "unbalanced load current limit",
        "небаланс по фазах"
    ],
    "mppt_efficiency_perc": [
        "mppt efficiency",
        "ККД трекінгу MPPT",
        "mppt_efficiency",
        "ефективність MPPT",
        "эффективность работы МРРТ",
        "MPPT tracking efficiency",
        "коефіцієнт корисної дії MPPT"
    ],
    "mppt_voltage_range_v_max": [
        "mppt voltage range",
        "Діапазон напруги MPPT",
        "mppt_voltage_range",
        "діапазон напруги на вході MPPT",
        "рабочий диапазон МРРТ",
        "MPPT operating voltage range",
        "діапазон напруги панелей для трекера"
    ],
    "mppt_voltage_range_v_min": [
        "mppt voltage range",
        "Діапазон напруги MPPT",
        "mppt_voltage_range",
        "діапазон напруги на вході MPPT",
        "рабочий диапазон МРРТ",
        "MPPT operating voltage range",
        "діапазон напруги панелей для трекера"
    ],

    "mppt_voltage_range_v": [
        "mppt voltage range",
        "Діапазон напруги MPPT",
        "mppt_voltage_range",
        "діапазон напруги на вході MPPT",
        "рабочий диапазон МРРТ",
        "MPPT operating voltage range",
        "діапазон напруги панелей для трекера"
    ],
    "night_time_consumption_w": [
        "night time consumption",
        "Споживання в режимі нічного очікування",
        "night_time_consumption",
        "споживання вночі без генерації",
        "ночное потребление",
        "потребление в режиме night mode",
        "споживання електроенергії вночі"
    ],
    "no_load_consumption_w": [
        "no load consumption",
        "Споживання без навантаження",
        "no_load_consumption",
        "потребление при отсутствии нагрузки",
        "standby power без навантаження",
        "холостой ход",
        "споживання без споживачів"
    ],

    "nominal_ac_power_w": [
        "nominal ac power",
        "Номінальна вихідна потужність по AC",
        "nominal_ac_power",
        "номинальная выходная мощность",
        "номінальна потужність по мережі",
        "rated AC power",
        "робоча потужність",
        "активна номінальна потужність"
    ],

    "nominal_battery_charge_power_w": [
        "nominal battery charge power",
        "Номінальна потужність заряду",
        "nominal_battery_charge_power",
        "номинальная мощность заряда АКБ",
        "battery charge nominal power",
        "power on battery side"
    ],
    "nominal_dc_voltage_v": [
        "nominal dc voltage",
        "Номінальна напруга по DC",
        "nominal_dc_voltage",
        "номинальное постоянное напряжение",
        "DC шина номинальное напряжение",
        "номінальна напруга шини постійного струму",
        "rated DC bus voltage"
    ],
    "nominal_frequency": [
        "nominal frequency",
        "Номінальна частота",
        "nominal_frequency",
        "номинальная частота сети",
        "50 Гц / 60 Гц номінально",
        "grid nominal frequency",
        "частота мережі по замовчуванню"
    ],
    "nominal_pv_voltage_v": [
        "nominal_pv_voltage",
        "номінальна напруга входу PV",
        "номінальна напруга масиву ФЕМ",
        "nominal PV voltage",
        "номинальное напряжение по стороне PV",
        "номінальна вхідна напруга ФЕМ",
        "номінальна вхідна напруга",
        "PV input nominal voltage",
        "номінальна напруга сонячних панелей для"
    ],
    "number_of_battery_inputs": [
        "number_of_battery_inputs",
        "Кількість входів для підключення",
        "number of battery inputs",
        "Килькисть входив для пидключення",
        "Кількість АКБ входів",
        "батарейных входов у",
        "Входи АКБ",
        "количество входов для АКБ"
    ],
    "number_of_mppt": [
        "number of mppt",
        "Кількість MPPT-трекерів",
        "MPPT трекери",
        "number_of_mppt",
        "количество МРРТ трекеров",
        "кількість незалежних МРР трекерів",
        "кількість незалежних МРРТ трекерів",
        "число МРРТ",
        "кількість трекерів максимальної потужності",
        "MPPT trackers count",
        "кількість трекерів MPPT",
        "MPPT кількість",
        "MPPT",
        "кількість MPPT"

    ],

    "offgrid_peak_power": [
        "offgrid_peak_power",
        "пікова потужність у режимі off-grid",
        "off-grid peak power",
        "максимальна короткочасна потужність при автономній роботі",
        "2× номінальна потужність у off-grid (короткочасна)",
        "піковая мощность в автономном режиме",
        "кратковременная перегрузочная мощность off-grid"
    ],

    "overvoltage_category": [
        "overvoltage category",
        "Категорія перенапруги",
        "категория перенапряжения",
        "overvoltage_category",
        "категорія перенапруги по стандарту",
        "overvoltage cat (III, IV)",
        "категорія перенапруги установки"
    ],
    #  "parallel_operation": [
    #   "parallel operation",
    #    "Паралельна робота",
    #    "режим параллельной работы",
    #    "возможность параллельного подключения нескольких",

    #    "parallel connection support",
    #    "параллельная схема включения"
    #  ],

    "peak_output_current": [
        "peak output current",
        "Піковий вихідний струм",
        "пиковаый ток на выходе",
        "струм при кратковременной перегрузке",
        "короткочасний максимальний струм",
        "peak current AC",
        "overload output current"
    ],

    "peak_output_power": [
        "peak output power",
        "Пікова вихідна потужність",
        "кратковременная максимальная мощность",
        "пікова потужність при перевантаженні",
        "overload power",
        "кратковременная перегрузочная мощность",
        "peak AC power"
    ],

    "pid_recovery": [
        "pid recovery",
        "Функція PID-регенерації",
        "відновлення деградації PID",
        "функция восстановления PID у панелей",
        "pid-регенерация",
        "anti-PID функция",
        "відновлення характеристик модулів"
    ],

    "power_assist": [
        "power assist",
        "Функція підтримки потужності (Power Assist)",
        "помощь мощности от сети/генератора",
        "power_assist",
        "підтримка навантаження за рахунок мережі",
        "функция подмеса мощности",
        "комбинированная мощность инвертор+сеть"
    ],

    "power_control": [
        "power control",
        "Керування потужністю",
        "ограничение мощности по % или кВт",
        "контроль генерации в сеть",
        "power control function",
        "регулювання вихідної потужності",
        "обрізає потужність",
        "можна обмежити кВт",
        "Можна обмежити потужність"
    ],

    "power_factor_range": [
        "power factor range",
        "Діапазон коефіцієнта потужності (cos φ)",
        "Диапазон cos φ",
        "допустимый диапазон коэффициента мощности",
        "налаштування cos φ",
        "power factor setting range",
        "cos φ leading/lagging",
        "Косинус",
        "Pf",
        "компенсація реактивної",
        "Реактивка",
        "реактивна потужність"
    ],

    "protection_class": [
        "protection class",
        "Клас електрозахисту",
        "класс защиты по изоляции",
        "protection_class",
        "класс электрической защиты устройства",
        "категория защиты пользователя от поражения током",
        "insulation class"
    ],

    "pv_working_current_a": [
        "pv_working_current",
        "робочий струм ФЕМ",
        "PV working current (Impp)",
        "робочий струм сонячного модуля в точці максимальної потужності",
        "рабочий ток PV массива",
        "струм панелей при Pmax",
        "Impp (робочий струм панелей)"
    ],

    "recommended_pv_power_w": [
        "recommended pv power",
        "Рекомендована потужність PV",
        "recommended_pv_power",
        "Рекомендована потужність сонячних панелей",
        "рекомендованная мощность PV массива",
        "мощность солнечной станции по рекомендации",
        "PV installed power recommended"
    ],

    "residual_current_monitoring": [
        "residual current monitoring",
        "Моніторинг диференційного (залишкового) струму",
        "контроль утечки тока",
        "контроль диференційних струмів",
        "RCMU",
        "residual current device monitoring",
        "мониторинг остаточного тока"
    ],

    "safety_standards": [
        "safety_standards",
        "стандарти безпеки (IEC 62109 тощо)",
        "яким стандартам електробезпеки відповідає",
        "нормы безопасности для",
        "перелік стандартів безпеки обладнання",
        "IEC/UL safety compliance",
        "стандарти електробезпеки пристрою"
    ],

    "sleep_mode_consumption_w": [
        "sleep mode consumption",
        "Споживання в режимі сну",
        "sleep_mode_consumption",
        "потребление в режиме сна",
        "споживання при вимкненому навантаженні (sleep)",
        "power in sleep mode",
        "standby sleep consumption",
        "споживання коли спит",
        "коли засинає",
        "у сні скільки ват",
        "споживає в режимі сну"
    ],

    "standby_self_consumption_w": [
        "standby self consumption",
        "Власне споживання в черговому режимі",
        "standby_self_consumption",
        "споживання в режимі очікування",
        "собственное потребление без нагрузки",
        "standby power",
        "холостой ход в режиме standby",
        "споживання без навантаження",
        "холостий хід",
        "standby скільки бере",
        "Стендбай",
        "коли просто увімкнений",
        "власне споживання"
    ],

    "start_up_voltage_v": [
        "start up voltage",
        "Напруга запуску",
        "start_up_voltage",
        "напряжение старта",
        "стартова напруга",
        "напруга старту",
        "мінімальна напруга старту",
        "напруга коли стартує",
        "напруга дял старту",
        "напруга для запуску",
        "напруга, при якій починає працювати",
        "мінімальна напруга для старту роботи",
        "DC start voltage",
        "напруга для запуску",
        "коли починає працювати",
        "якої напруги запускається"
    ],

    "string_monitoring": [
        "string monitoring",
        "Моніторинг стрінгів",
        "контроль по стрингам",
        "мониторинг токов/напряжений по стрингам",
        "контроль роботи окремих стрінгів",
        "string-level monitoring",
        "отслеживание параметров стрингов"
    ],

    "strings_per_mppt": [
        "strings per mppt",
        "Кількість стрінгів на один MPPT",
        "strings_per_mppt",
        "количество стрингов на трекер",
        "максимальное число стрингов на MPPT",
        "кількість паралельних стрінгів на трекері",
        "PV strings per tracker",
        "ліній на MPPT",
        "входів на MPPT",
        "стрінгів на трекер",
        "стрінгів на один MPPT",
        "один MPPT на скільки стрінгів",
        "стрінгів на MPPT",
        "на один трекер скільки панелей",
        "стрінгів можна повісити",
        "MPPT на скільки гілок",
        "кількість підключень MPPT"
    ],

    "surge_protection": [
        "surge protection",
        "Захист від імпульсних перенапруг",
        "захист від грозових імпульсів",
        "встроенная СПД",
        "surge protection device",
        "SPD внутри",
        "захист від грози та перенапруг"
    ],

    "temperature_derating": [
        "temperature_derating",
        "дерейтинг потужності за температурою",
        "зниження вихідної потужності при підвищенні температури",
        "temperature derating curve",
        "температурная дерейтинг-кривая",
        "втрата потужності на жарі",
        "залежність доступної потужності від температури"
    ],

    "temperature_protection": [
        "temperature protection",
        "Захист від перегріву",
        "температурный защитный режим",
        "защита от перегрева",
        "автоматическое отключение при перегреве",
        "overtemperature protection",
        "температурна захист"
    ],

    "thd_perc": [
        "thd",
        "Сумарні гармонічні спотворення (THD)",
        "thd_perc",
        "коэффициент нелинейных искажений",
        "гармонічні спотворення струму/напруги",
        "total harmonic distortion",
        "THD %"
    ],

    "transfer_time_ms": [
        "transfer time",
        "Час перемикання між мережею і резервним режимом",
        "transfer_time",
        "Час перемикання",
        "Время переключения",
        "час переходу на резерв",
        "switching time UPS/grid",
        "затримка при перемиканні"
    ],

    # ------ГЛОССАРИЙ ПАРАМЕТРОВ БАТАРЕЙ----

    "nominal_energy_kwh": [
        "номінальна енергія",
        "номінальна енергетична ємність",
        "ємність у кВт·год",
        "номинальная энергия",
        "номинальная емкость по энергии",
        "энергетическая емкость кВт·ч",
        "nominal energy",
        "nominal energy capacity",
    ],

    "usable_energy_kwh": [
        "корисна енергія",
        "доступна енергія",
        "корисна ємність",
        "полезная энергия",
        "доступная энергия",
        "полезная емкость",
        "usable energy",
        "usable energy capacity",
    ],

    "charge_temp_range_degC": [
        "діапазон температури заряду",
        "температурний діапазон заряджання",
        "діапазон температур заряджання",
        "діапазон температур зарядження",
        "диапазон температуры зарядки",
        "рабочая температура зарядки",
        "charge temperature range",
        "charging temperature range",
        "Температура заряду"
    ],

    "charge_temp_range_min_degc": [
        "мінімальна температура заряду",
        "нижня температура заряджання",
        "минимальная температура зарядки",
        "нижний предел температуры зарядки",
        "min charge temperature",
        "minimum charging temperature",
    ],

    "charge_temp_range_max_degc": [
        "максимальна температура заряду",
        "верхня температура заряджання",
        "максимальная температура зарядки",
        "верхний предел температуры зарядки",
        "max charge temperature",
        "maximum charging temperature",
    ],

    "power_module_dimensions_mm_length": [
        "довжина модуля живлення",
        "габарит по довжині модуля",
        "длина модуля питания",
        "длина силового модуля мм",
        "length power module",
        "power module length mm",
    ],

    "power_module_dimensions_mm_width": [
        "ширина модуля живлення",
        "габарит по ширині модуля",
        "ширина модуля питания",
        "ширина силового модуля мм",
        "width power module",
        "power module width mm",
    ],

    "power_module_dimensions_mm_height": [
        "висота модуля живлення",
        "габарит по висоті модуля",
        "высота модуля питания",
        "высота силового модуля мм",
        "height power module",
        "power module height mm",
    ],

    "max_modules_parallel": [
        "максимальна кількість модулів паралельно",
        "максимум модулів у паралель",
        "максимальное количество модулей параллельно",
        "сколько модулей можно подключить параллельно",
        "max modules in parallel",
        "maximum parallel modules",
    ],

    "max_stacks_parallel": [
        "максимальна кількість стеків паралельно",
        "кількість стеків у паралель",
        "максимальное количество стеков параллельно",
        "сколько стеков можно подключить параллельно",
        "max stacks in parallel",
        "maximum parallel stacks",
    ],

    "recommended_charge_discharge_current_a": [
        "рекомендований зарядно-розрядний струм",
        "оптимальний зарядно-розрядний струм",
        "рекомендуемый ток заряда и разряда",
        "оптимальный ток заряда разряда",
        "recommended charge discharge current",
    ],

    # "recommended_charge_current_a": [
    #    "рекомендований струм заряду",
    #    "оптимальний струм заряду",
    #    "рекомендуемый ток зарядки",
    #    "оптимальный ток заряда",
    #    "recommended charge current",
    # ],

    "recommended_discharge_current_a": [
        "рекомендований струм розряду",
        "оптимальний струм розряду",
        "рекомендуемый ток разряда",
        "оптимальный ток разряда",
        "recommended discharge current",
    ],

    "nominal_capacity_ah": [
        "ємність в ампер-годинах",
        "ємність у А·год",
        "номинальная емкость в ампер-часах",
        "емкость в а·ч",
        "capacity ah",
        "nominal capacity ah",
        "Ємність"
    ],

    "depth_of_discharge_percent": [
        "глибина розряду",
        "глибина допустимого розряду",
        "глубина разряда",
        "допустимая глубина разряда",
        "depth of discharge",
        "dod",
    ],

    "recommended_c_rate": [
        "рекомендований c-rate",
        "рекомендована швидкість заряду розряду",
        "рекомендуемый c-rate",
        "рекомендуемая скорость заряда разряда",
        "recommended c rate",

        "рекомендований коефіцієнт зарядки",
        "з якою швидкістю",
        "допустимий C-rate",
        "швидкість зарядки",
        "C-rate"

    ],

    "charge_cutoff_voltage_v": [
        "напруга відключення заряду",
        "гранична напруга заряду",
        "напряжение отсечки заряда",
        "порог отключения зарядки",
        "cutoff charge voltage",
        "напруга відсічення зарядки",
        "максимальна напруга зарядки",
        "напруги заряджається",
        "напрузі зупиняється зарядка",
        "гранична напруга зарядки",
        "кінцева напруга зарядки",
        "верхня напруга зарядки",
        "макс напруга при зарядці",
        "напруга завершення зарядки",

        "мінімальна cutoff напруга заряду",
        "мінімальна напруга відключення заряду",
        "минимальное напряжение отсечки заряда",
        "min charge cutoff voltage",

        "максимальна cutoff напруга заряду",
        "максимальна напруга відключення заряду",
        "максимальное напряжение отсечки заряда",
        "max charge cutoff voltage",
    ],

    "charge_cutoff_voltage_min_v": [

    ],

    "charge_cutoff_voltage_max_v": [

    ],

    "discharge_cutoff_voltage_v": [
        "напруга відключення розряду",
        "гранична напруга розряду",
        "напряжение отсечки разряда",
        "порог отключения разряда",
        "cutoff discharge voltage",
        "напруга відсічення розряду",
        "мінімальна напруга розряду",
        "напруги можна розряджати",
        "при якій напрузі відключається розряд",
        "гранична напруга розряду",
        "нижня напруга",
        "коли батарея відключається",
        "мін напруга при розряді",
        "поріг відключення",
        "коли перестає розряджатися"

        "мінімальна cutoff напруга розряду",
        "мінімальна напруга відключення розряду",
        "минимальное напряжение отсечки разряда",
        "min discharge cutoff voltage",

    ],

    "discharge_cutoff_voltage_min_v": [

    ],

    "design_life_years": [
        "розрахунковий строк служби",
        "паспортний термін служби",
        "расчетный срок службы",
        "срок службы по паспорту",
        "design life",
        "design life years",
    ],

    "cycle_life_cycles": [
        "кількість циклів",
        "ресурс по циклах",
        "кількість циклів заряд розряд",
        "число рабочих циклов",
        "ресурс по циклам",
        "cycle life",
        "number of cycles",
        "charge discharge cycles",
        "ресурс батареї в циклах",
        "циклів витримує",
        "кількість циклів заряд розряд",
        "ресурс акумулятора",
        "циклів роботи",
        "життєвий цикл",
        "на скільки циклів вистачає",
        "разів можна заряджати",
        "термін служби в циклах"
    ],

    "peak_current_15s_a": [
        "піковий струм 15 секунд",
        "пусковий струм 15с",
        "пиковый ток 15 секунд",
        "кратковременный ток 15 секунд",
        "peak current 15s",
        "surge current 15s",
        "піковий струм на короткий час",
        "короткочасний піковий струм",
        "стартовий струм",
        "пусковий струм",
        "піковий струм при запуску",
        "короткий пік по струму",
        "максимальний струм на старті",
        "струм ривка",
        "піковий струм на кілька секунд",
        "short peak current",

        "мінімальний піковий струм 15 секунд",
        "минимальный пиковый ток 15 секунд",
        "minimum peak current 15s",

        "максимальний піковий струм 15 секунд",
        "максимальний струм протягом 15 секунд",
        "максимальный пиковый ток 15 секунд",
        "предельный ток 15 секунд",
        "maximum peak current 15s",
        "15 second peak current maximum",
    ],

    "peak_current_15s_min_a": [

    ],

    "peak_current_60s_a": [
        "піковий струм 60 секунд",
        "пусковий струм 60с",
        "пиковый ток 60 секунд",
        "кратковременный ток 60 секунд",
        "peak current 60s",
        "surge current 60s",
        "піковий струм на довший час",
        "піковий струм протягом хвилини",
        "довготривалий піковий струм",
        "пікове навантаження до хвилини",
        "струм тримає деякий час",
        "підвищений струм без відключення",
        "піковий режим роботи",
        "максимальний струм не миттєвий",
        "sustained peak current",

        "мінімальний піковий струм 60 секунд",
        "минимальный пиковый ток 60 секунд",
        "minimum peak current 60s",

        "максимальний піковий струм 60 секунд",
        "максимальный пиковый ток 60 секунд",
        "maximum peak current 60s"
    ],

    "peak_current_60s_min_a": [

    ],

    "peak_current_60s_max_a": [

    ],

    "peak_current_15s_max_a": [

    ],

    # "protections": [
    #    "захисти",
    #    "функції захисту",
    #    "комплекс захистів",
    #    "защиты",
    #    "функции защиты",
    #    "protection functions",
    #    "protections",
    # ],

    "max_charge_discharge_current_a": [
        "максимальний зарядно розрядний струм",
        "граничний струм заряджання та розряду",
        "максимальний двонаправлений струм",
        "максимальный ток заряда и разряда",
        "предельный ток зарядки и разрядки",
        "maximum charge discharge current",
        "maximum bidirectional current",
        "максимальний струм зарядки і розрядки",
        "граничний струм акумулятора",
        "максимальний струм можна",
        "макс струм",
        "ампер можна заряджати",
        "ампер можна знімати",
        "ліміт по струму",
        "максимально допустимий струм",
        "обмеження по струму",
        "current limit"
    ],

    "power_module_dimensions_mm": [
        "габарити модуля живлення",
        "розміри модуля живлення",
        "загальні габарити модуля",
        "габариты модуля питания",
        "размеры модуля питания",
        "общие габариты модуля",
        "power module dimensions",
        "overall power module dimensions",
        "power module size",
        "розміри силового модуля",
        "які розміри модуля",
        "довжина ширина висота модуля",
        "габаритні розміри модуля",
        "розмір силового блоку"
    ],

    "discharge_cutoff_voltage_max_v": [
        "максимальна напруга відключення розряду",
        "верхня межа напруги відсічення розряду",
        "максимальная напряжение отсечки разряда",
        "верхний предел напряжения отключения разряда",
        "maximum discharge cutoff voltage",
        "max discharge cutoff voltage",
        "максимальна напруга відсічення розряду",
        "верхня межа напруги відключення розряду",
        "макс поріг відсічення",
        "напруги спрацьовує відсічення розряду",
        "верхній поріг відключення",
        "максимальна напруга відключення по розряду",
        "гранична верхня напруга розряду",
        "макс значення напруги відсічення",
        "верхня межа порогу розряду",
        "коли відсічення розряду ще діє"
    ],

    # ------ГЛОССАРИЙ ПАРАМЕТРОВ СЧЕТЧИКОВ----

    "accessories_required": [
        "необхідні аксесуари",
        "додаткові компоненти",
        "обовʼязкові комплектуючі",
        "необходимые аксессуары",
        "дополнительные компоненты",
        "обязательные комплектующие",
        "required accessories",
        "required additional components",
        "necessary accessories",
    ],

    "accuracy_class_active": [
        "клас точності активної енергії",
        "точність вимірювання активної енергії",
        "класс точности активной энергии",
        "точность измерения активной энергии",
        "active energy accuracy class",
        "accuracy class for active energy",
    ],

    "accuracy_class_reactive": [
        "клас точності реактивної енергії",
        "точність вимірювання реактивної енергії",
        "класс точности реактивной энергии",
        "точность измерения реактивной энергии",
        "reactive energy accuracy class",
        "accuracy class for reactive energy",
    ],

    "bidirectional_measurement": [
        "двонаправлений облік",
        "облік імпорту та експорту",
        "двунаправленный учет",
        "учет импорта и экспорта",
        "bidirectional measurement",
        "import export measurement",
        "two way energy measurement",
        "рахує в обидва боки",
        "рахує споживання і віддачу",
        "облік енергії в обидві сторони",
        "бачить імпорт і експорт",
        "окремо рахує вхід і вихід",
        "лічить коли беру і коли віддаю",
        "показує віддачу в мережу",
        "показує споживання з мережі",
        "двосторонній облік",
        "import export measurement",
    ],

    "communication_protocols": [
        "протоколи звʼязку",
        "підтримувані протоколи",
        "протоколы связи",
        "поддерживаемые протоколы",
        "communication protocols",
        "supported protocols",
        "data communication protocols",
    ],

    "ct_secondary_current_a": [
        "вторинний струм трансформатора",
        "вихідний струм тт",
        "вторичный ток трансформатора",
        "выходной ток тт",
        "ct secondary current",
        "current transformer secondary current",
        "вторинний струм CT",
        "струм вторинної обмотки CT",
        "CT 1А чи 5А",
        "підтримує CT на 5А",
        "підтримує CT на 1А",
        "вхід CT 1А",
        "вхід CT 5А",
        "номінальний струм CT",
        "secondary current CT"
    ],

    "ct_supported": [
        "підтримка трансформаторів струму",
        "робота через тт",
        "поддержка трансформаторов тока",
        "работа через тт",
        "ct supported",
        "current transformer support",
        "підтримка струмових трансформаторів",
        "підтримує CT",
        "чи можна підключити трансформатор струму",
        "є підтримка CT",
        "працює з струмовими трансформаторами",
        "можна підключити CT",
        "підтримка лічильника з CT",
        "працює через трансформатор струму",
        "CT підтримується",
        "CT сумісність"
    ],

    "current_connection_type": [
        "тип підключення по струму",
        "пряме або через тт",
        "тип токового подключения",
        "прямое или через тт",
        "current connection type",
        "direct or transformer connection",
    ],

    "demand_measurement": [
        "вимірювання максимального навантаження",
        "облік пікового навантаження",
        "измерение максимальной нагрузки",
        "учет пикового потребления",
        "demand measurement",
        "maximum demand measurement",
    ],

    "digits_count": [
        "цифр відображення",
        "отображаемых цифр",
        "digits count",
        "number of display digits",
        "розрядність лічильника",
        "знаків на лічильнику",
        "формат показів",
        "знаків у показах",
        "цифр у показнику",
    ],

    "din_modules": [
        "кількість din модулів",
        "ширина у din модулях",
        "количество din модулей",
        "ширина в din модулях",
        "din rail modules",
        "number of din modules",
    ],

    "dynamic_power_reduction": [
        "динамічне обмеження потужності",
        "керування потужністю в реальному часі",
        "динамическое ограничение мощности",
        "управление мощностью в реальном времени",
        "dynamic power reduction",
        "dynamic power control",
        "автоматичне зменшення потужності",
        "потужність зменшується автоматично",
        "підрізає потужність по ситуації",
        "регулює потужність в реальному часі",
        "автоматично знижує генерацію",
        "динамічно обмежує генерацію",
        "потужність міняється на льоту",
        "адаптивне обмеження потужності",
        "dynamic power reduction"
    ],

    "export_limitation_support": [
        "обмеження видачі в мережу",
        "підтримка zero export",
        "ограничение выдачи в сеть",
        "поддержка zero export",
        "export limitation support",
        "zero export functionality",
        "обмеження видачі в мережу",
        "обмеження генерації в мережу",
        "ліміт на експорт в мережу",
        "обмеження віддачі в мережу",
        "контроль видачі в мережу",
        "zero export",
        "режим zero export",
        "підтримка нульового експорту",
        "без видачі в мережу",
        "не віддає в мережу",
        "щоб не пускало в мережу",
        "обмеження по лічильнику",
        "обмеження по CT",
        "експорт в мережу обмеження",
        "export limitation",
        "grid export limit"
    ],

    "indoor_only": [
        "тільки для внутрішнього встановлення",
        "експлуатація в приміщенні",
        "только для установки внутри помещения",
        "эксплуатация в помещении",
        "indoor installation only",
        "indoor use only",
        "лише для монтажу в приміщенні",
        "експлуатація тільки в приміщенні",
        "для установки всередині",
        "не для вулиці",
        "на вулиці не можна",
        "тільки в середині приміщення",
        "не підходить для зовнішнього монтажу",
        "потрібно ставити в приміщенні",
        "всередині будівлі",
        "indoor installation only",
    ],

    "measured_quantities": [
        "вимірювані величини",
        "параметри що вимірюються",
        "измеряемые величины",
        "измеряемые параметры",
        "measured quantities",
        "measured electrical parameters",
        "що він вимірює",
        "які параметри показує",
        "що показує лічильник",
        "які дані вимірює",
        "які величини рахує",
        "що можна побачити в показах",
        "які електричні параметри вимірює",
        "показники які відображає",
        "measured quantities",
    ],

    "overload_capacity": [
        "перевантажувальна здатність",
        "допустиме короткочасне перевантаження",
        "перегрузочная способность",
        "допустимая кратковременная перегрузка",
        "overload capacity",
        "current overload capability",

        "перевантаження по потужності",
        "чи витримає перевантаження",
        "може перевищити номінал",
        "чи не вибʼє при перевантаженні",
        "працює з перевантаженням",
        "допускає перевищення потужності",
        "витримує більше номіналу",
        "короткочасно більше номіналу",
        "overload capacity",
        "overload capability"
    ],

    "rs485_max_distance_m": [
        "максимальна довжина rs485",
        "гранична відстань rs485",
        "максимальная длина rs485",
        "предельная дистанция rs485",
        "rs485 maximum distance",
        "rs485 communication length",
    ],

    "standard_active_energy": [
        "стандарт обліку активної енергії",
        "норматив вимірювання активної енергії",
        "стандарт учета активной энергии",
        "норматив измерения активной энергии",
        "active energy standard",
        "active energy measurement standard",
    ],

    "standard_reactive_energy": [
        "стандарт обліку реактивної енергії",
        "норматив вимірювання реактивної енергії",
        "стандарт учета реактивной энергии",
        "норматив измерения реактивной энергии",
        "reactive energy standard",
        "reactive energy measurement standard",
    ],

    "starting_current_ma": [
        "пусковий струм",
        "мінімальний струм спрацювання",
        "пусковой ток",
        "минимальный ток срабатывания",
        "starting current",
        "minimum operating current",
    ],

    "supported_installation_paths": [
        "допустимі схеми встановлення",
        "варіанти монтажу в системі",
        "допустимые схемы установки",
        "варианты монтажа в системе",
        "supported installation paths",
        "allowed installation configurations",
    ],

    "terminal_capacity_max_mm2": [
        "максимальний переріз кабелю",
        "максимальне січення провідника",
        "максимальное сечение кабеля",
        "максимальное сечение проводника",
        "maximum terminal cable size",
        "max conductor cross section",
        "максимальний кабель можна підключити",
        "найбільший кабель влазить",
        "макс переріз дроту",
        "до якого перерізу приймає клема",
        "кабель можна зажати",
        "максимальний розмір кабелю",
        "клема під який максимум кабель",
        "Кабель туди влізе",
        "товстий кабель можна підключити",
    ],

    "terminal_capacity_min_mm2": [
        "мінімальний переріз кабелю",
        "мінімальне січення провідника",
        "минимальное сечение кабеля",
        "минимальное сечение проводника",
        "minimum terminal cable size",
        "min conductor cross section",
        "мінімальний кабель можна підключити",
        "найтонший кабель підходить",
        "мін переріз дроту",
        "від якого перерізу приймає клема",
        "чи підійде тонкий кабель",
        "Від якого перерізу",
        "мінімальний розмір кабелю",
        "клема під який мінімум кабель",
        "найменший кабель можна зажати",
    ],

    "terminal_capacity_signal_max_mm2": [
        "максимальний переріз сигнального кабелю",
        "максимальний сигнальний кабель можна підключити",
        "найбільший сигнальний дріт влазить",
        "макс переріз сигнального дроту",
        "до якого перерізу приймає сигнальна клема",
        "сигнальний кабель можна зажати",
        "максимальний розмір сигнального кабелю",
        "клема сигналу під який максимум кабель",
        "товстий сигнальний дріт можна",
        "maximum signal cable size",
        "signal terminal max cross section"
    ],

    "terminal_capacity_signal_min_mm2": [
        "мінімальний переріз сигнального кабелю",
        "мінімальний сигнальний кабель підходить",
        "найтонший сигнальний дріт можна підключити",
        "мін переріз сигнального дроту",
        "від якого перерізу приймає сигнальна клема",
        "чи підійде тонкий сигнальний кабель",
        "мінімальний розмір сигнального кабелю",
        "клема сигналу під який мінімум кабель",
        "найменший сигнальний дріт який можна зажати",
        "minimum signal cable size",
    ],

    "termination_resistor": [
        "термінуючий резистор",
        "узгодження лінії звʼязку",
        "терминирующий резистор",
        "согласование линии связи",
        "termination resistor",
        "bus termination resistor",
    ],

    # ------ГЛОССАРИЙ ПАРАМЕТРОВ ЛОГГЕРОВ----

    "bluetooth_support": [
        "підтримка Bluetooth",
        "Bluetooth інтерфейс",
        "BT модуль",
        "поддержка Bluetooth",
        "Bluetooth интерфейс",
        "модуль Bluetooth",
        "Bluetooth support",
        "BT connectivity",
    ],

    "usb_ports": [
        "USB порти",
        "USB інтерфейси",
        "USB host/device порти",
        "USB порты",
        "USB интерфейсы",
        "порты USB host device",
        "USB ports",
        "USB interfaces",
    ],

    "digital_outputs": [
        "цифрові виходи",
        "DO виходи",
        "цифровые выходы",
        "DO выходы",
        "digital outputs",
        "DO ports",
        "discrete outputs",
    ],

    "relay_outputs": [
        "релейні виходи",
        "RO виходи",
        "релейные выходы",
        "RO выходы",
        "relay outputs",
        "relay contacts",
        "RO ports",
    ],

    "supported_devices": [
        "підтримувані пристрої",
        "сумісні пристрої",
        "поддерживаемые устройства",
        "совместимые устройства",
        "supported devices",
        "compatible equipment",
        "device compatibility",
    ],

    "max_devices_supported": [
        "максимальна кількість пристроїв",
        "ліміт підключених пристроїв",
        "максимальное количество устройств",
        "лимит подключаемых устройств",
        "maximum devices supported",
        "device connection limit",
    ],

    "ve_bus": [
        "VE.Bus інтерфейс",
        "VE.Bus порт",
        "интерфейс VE.Bus",
        "порт VE.Bus",
        "VE Bus interface",
        "VE.Bus communication",
    ],

    "ve_direct_ports": [
        "VE.Direct порти",
        "інтерфейси VE.Direct",
        "порты VE.Direct",
        "интерфейсы VE.Direct",
        "VE.Direct ports",
        "VE Direct interfaces",
    ],

    "status_indicators": [
        "індикатори стану",
        "LED індикація",
        "индикаторы состояния",
        "LED индикация",
        "status indicators",
        "LED status lights",
    ],

    # ------ГЛОССАРИЙ ПАРАМЕТРОВ ЕПМ ----

    "control_method": [
        "метод керування",
        "алгоритм керування",
        "спосіб керування",
        "метод управления",
        "алгоритм управления",
        "способ управления",
        "control method",
        "control algorithm",
        "power control method",
    ],

    "ct_input_support": [
        "підтримка трансформаторів струму",
        "входи трансформаторів струму",
        "робота через тт",
        "поддержка трансформаторов тока",
        "входы трансформаторов тока",
        "работа через тт",
        "ct input support",
        "current transformer support",
        "ct inputs available",
    ],

    "ct_specification": [
        "специфікація трансформаторів струму",
        "параметри тт",
        "характеристики трансформаторів струму",
        "спецификация трансформаторов тока",
        "параметры тт",
        "характеристики трансформаторов тока",
        "ct specification",
        "current transformer specification",
    ],

    "export_limit_modes": [
        "режими обмеження експорту",
        "налаштування ліміту експорту",
        "режими zero export",
        "режим ограничения экспорта",
        "настройки ограничения экспорта",
        "режимы zero export",
        "export limit modes",
        "export limitation modes",
        "export control modes",
    ],

    "meter_input_interface": [
        "інтерфейс підключення лічильника",
        "порт підключення вимірювального пристрою",
        "интерфейс подключения измерительного устройства",
        "порт подключения измерительного устройства",
        "интерфейс подключения счетчика",
        "meter input interface",
        "measurement device interface",
        "meter communication port",
    ],

    "meter_type_supported": [
        "підтримувані типи вимірювальних пристроїв",
        "сумісні типи лічильників",
        "поддерживаемые типы измерительных устройств",
        "совместимые типы счетчиков",
        "meter types supported",
        "supported meter types",
    ],

    "no_of_connections": [
        "кількість підключень",
        "максимальна кількість зʼєднань",
        "количество подключений",
        "максимальное количество соединений",
        "number of connections",
        "max simultaneous connections",
    ],

    "power_regulation_period_s": [
        "період регулювання потужності",
        "інтервал оновлення керування потужністю",
        "период регулирования мощности",
        "интервал управления мощностью",
        "шаг регулирования мощности",
        "power regulation period",
        "power control interval",
        "regulation interval seconds",
    ],

    "reactive_power_support": [
        "підтримка реактивної потужності",
        "керування реактивною потужністю",
        "поддержка реактивной мощности",
        "управление реактивной мощностью",
        "reactive power support",
        "q control support",
        "reactive power control",
    ],

    "zero_export_support": [
        "підтримка zero export",
        "нульова видача в мережу",
        "обмеження експорту",
        "поддержка zero export",
        "нулевая выдача в сеть",
        "ограничение экспорта",
        "zero export support",
        "export blocking support",
    ],

    "active_power_support": [
        "керування активною потужністю",
        "підтримка активної потужності",
        "управление активной мощностью",
        "поддержка активной мощности",
        "active power support",
        "p control support",
        "active power control",
    ],

    # ------ГЛОССАРИЙ ПАРАМЕТРОВ СКБ ----

    "external_power_supply": [
        "зовнішнє живлення",
        "живлення від зовнішнього джерела",
        "внешнее питание",
        "питание от внешнего источника",
        "external power supply",
        "external power input",
        "powered externally",
    ],

    "firmware_update_method": [
        "метод оновлення прошивки",
        "спосіб оновлення програмного забезпечення",
        "метод обновления прошивки",
        "способ обновления прошивки",
        "обновление программного обеспечения",
        "firmware update method",
        "software update method",
        "firmware upgrade procedure",
    ],

    "i_o_description": [
        "опис входів і виходів",
        "схема підключення io",
        "опис входов и выходов",
        "назначение входов и выходов",
        "схема подключения io",
        "i o description",
        "input output description",
        "io configuration description",
    ],

    "internal_power_supply": [
        "вбудоване живлення",
        "внутрішнє джерело живлення",
        "встроенное питание",
        "внутренний источник питания",
        "internal power supply",
        "built in power supply",
    ],

    "io_ports_available": [
        "доступні порти введення виведення",
        "кількість io портів",
        "доступные порты ввода вывода",
        "количество io портов",
        "сколько портов ввода вывода",
        "io ports available",
        "available input output ports",
    ],

    "logging_functionality": [
        "функції журналювання",
        "запис даних",
        "функции логирования",
        "ведение журнала событий",
        "запись данных",
        "logging functionality",
        "data logging capability",
        "event logging",
    ],

    # "max_battery_modules_supported": [
    #   "максимальна кількість модулів",
    #  "ліміт підтримуваних модулів",
    #  "максимальное количество модулей",
    #  "лимит поддерживаемых модулей",
    #  "сколько модулей поддерживается",
    #  "maximum modules supported",
    #  "max supported modules",
    # ],

    "plc_support": [
        "підтримка plc",
        "звʼязок по силовій лінії",
        "поддержка plc",
        "связь по силовой линии",
        "power line communication",
        "plc support",
        "power line communication support",
    ],

    "power_supply_voltage": [
        "напруга живлення",
        "діапазон напруги живлення",
        "напряжение питания",
        "диапазон напряжения питания",
        "питающее напряжение",
        "power supply voltage",
        "input supply voltage",
    ],

    "rs485_port_description": [
        "опис порту rs485",
        "призначення інтерфейсу rs485",
        "опис порта rs485",
        "назначение порта rs485",
        "опис интерфейса rs485",
        "rs485 port description",
        "rs485 interface description",
    ],

    # "supported_inverter_types": [
    #    "підтримувані типи інверторів",
    #    "сумісні інвертори",
    #    "поддерживаемые типы инверторов",
    #    "совместимые типы инверторов",
    #    "какие инверторы поддерживаются",
    #    "supported inverter types",
    #    "compatible inverter types",
    # ],

    "supported_management_platforms": [
        "підтримувані платформи керування",
        "системи моніторингу",
        "поддерживаемые платформы управления",
        "платформы мониторинга",
        "системы мониторинга",
        "supported management platforms",
        "supported monitoring platforms",
    ],

    "supported_storage_systems": [
        "підтримувані системи зберігання",
        "сумісні системи накопичення",
        "поддерживаемые системы хранения",
        "совместимые системы накопления",
        "какие системы хранения поддерживаются",
        "supported storage systems",
        "compatible storage systems",
    ],

    "backup_power_support": [
        "підтримка резервного живлення",
        "робота від резервного джерела",
        "поддержка резервного питания",
        "работа от резервного источника питания",
        "backup power support",
        "backup power capability",
    ]
}
